#include <stdio.h>

#define EMPTY 			/* 可以通过编译 */
#define SUM(x) ((x)+(x)) 	/* 注意最外层的括号 */

/********************************************
 * 以下宏定义注意，在Y的宏定义过程中，
 * X不会被主动替换成3，然后取消X宏定义，
 * 再定义X，则按X最后被定义的值来算，即2
 ********************************************/
#define X 3
#define Y X*2
#undef 	X
#define X 2
int i = Y;

/********************************************
 * #运算符的用法：替换字符串
 * 以下SQR(5)输出为：the square of 5 is 25
 ********************************************/
#define SQR(x) printf("the square of "#x" is %d\n", ((x)*(x)));



/********************************************
 * ##运算符的用法：类似粘合剂
 * 以下XNAME(5)输出为：x5
 ********************************************/
#define XNAME(n) "x##n"
int main(){
	printf("SUM(5) = %d\n", SUM(5));
	SQR(5)
	printf("i = %d\n", i);
	return 0;
}
